	{
  "_name_or_path": "Blaise-g/longt5_tglobal_large_sumpubmed",
  "architectures": [
    "LongT5ForConditionalGeneration"
  ],
  "d_ff": 2816,
  "d_kv": 64,
  "d_model": 1024,
  "decoder_start_token_id": 0,
  "dense_act_fn": "gelu_new",
  "dropout_rate": 0.1,
  "early_stopping": true,
  "encoder_attention_type": "transient-global",
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "global_block_size": 16,
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "length_penalty": 0.8,
  "local_radius": 127,
  "max_length": 512,
  "min_length": 100,
  "model_type": "longt5",
  "n_positions": 4096,
  "no_repeat_ngram_size": 3,
  "num_beams": 2,
  "num_decoder_layers": 24,
  "num_heads": 16,
  "num_layers": 24,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "repetition_penalty": 3.5,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "Transformers_version": "4.21.3",
  "use_cache": true,
  "vocab_size": 32100
}
		
